package student_dmitrijs_visuns.homeworks.lesson_3.day_2;

//Напишите программу в которой создайте переменную
//типа String и присвойте ей в качестве начального значения
//ваше имя. Выведете на консоль значение этой переменной.

class Task_7 {

    public static void main(String[] args) {

        String myName = "Дима";
        System.out.println(myName);

    }


}
