package student_dmitrijs_visuns.homeworks;
// Задача 5 (level 2): Дан код, нужно сделать этот код запускаемым.

public class Task_7 {  //class LoginService

    public static void main(String[] args) {

        System.out.println("You can login!");

    }
}
