package student_dmitrijs_visuns.homeworks.lesson_5.day_2;

/*Написать программу, в которой:
        - создать массив целых чисел длиной 3,
        - заполнить каждую ячейку массива любым числом,
        - вывести значение каждой ячейки на консоль. */

class Task_10 {

    public static void main(String[] args) {

        int[] sheet = new int [3];

        sheet[0] = 223;
        sheet[1] = 308;
        sheet[2] = 375;

        System.out.println(sheet[0]);
        System.out.println(sheet[1]);
        System.out.println(sheet[2]);

    }

}
