package student_vadim_sokolenko;

public class day5task15 {

    public static void main(String[] args) {

        //Найти в интернете как выводить на консоль строки без перевода курсора на новую строку.
        //Написать программу, которая демонстрирует это.
        System.out.println("Hello World!");
        System.out.println("Bye World!");


    }
}
