package student_dmitrijs_visuns.homeworks.lesson_2.day_5;
// Найти в интернете как выводить на консоль строки без перевода курсора на новую строку.
//Написать программу, которая демонстрирует это.


class Task_15 {

    public static void main(String[] args) {

        System.out.print("Hello ");
        System.out.print("my name is Java");

    }

}
