package student_vadim_sokolenko.Lesson2;

class Day4task13 {

    //1. Независимо от того, какую операционную систему вы используете, Linux, Mac или Windows, если на вашем компьютере установлен JDK (Java Development Kit), вы можете в консоли набрать следующие команды чтобы скомпилировать и запустить программу:
    //
    //javac (или  javac.exe)
    //java (или  java.exe)
    //В первом случае будет вызван компилятор javac.exe, а во втором случае — запускалка java.exe, которая стартует нашу программу. Эти файлы лежат в папке bin  вашего JDK.
    //
    //Рассмотрим на примере. Вспомним код из первого урока — создадим файл с названием Main.java.
    //
    //class Main {
    //    public static void main(String[] args) {
    //        System.out.println("Hello, World!");
    //    }
    //}
    //1
    //2
    //3
    //4
    //5
    //class Main {
    //    public static void main(String[] args) {
    //        System.out.println("Hello, World!");
    //    }
    //}
    //Идем в папку, куда среда  разработки сохранила проект. Я работаю в IntelliJIDEA, и мой проект лежит в C:\Users\имя пользователя\IdeaProjects\название проекта\src. Находим там наш файл Main.java. Консоль вызывается так: щелкаем правой клавишей мыши с зажатой клавишей Shift на пустом месте в папке, где лежит файл нашей программы, и выбираем пункт контекстного меню «Открыть окно команд».
    //Для того, чтобы скомпилировать его нужно набрать в консоли команду javac и в качестве параметра передать имя нашего файла:
    //
    //javac Main.java
    //1
    //javac Main.java
    //Эта команда вызовет компилятор, который создаст файл Main.class, содержащий скомпилированный код нашей java программы.
    //
    //Чтобы запустить ее, нужно ввести команду java с именем класса (не файла!) в качестве параметра:
}
