package student_vadim_sokolenko.Lesson2;

class Day5task15 {

    public static void main(String[] args) {

        //Найти в интернете как выводить на консоль строки без перевода курсора на новую строку.
        //Написать программу, которая демонстрирует это.
        System.out.print("Hello World!");
        System.out.print("Bye World!");


    }
}
