package student_aleksey_kodin.lesson5.day3.task_22;
//Найдите логическую ошибку в программе и исправить её:
class LoopDefinition6 {

    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {
            System.out.println(i);
        }
    }
}
