package student_dmitrijs_visuns.homeworks.lesson_2.day_2;
// Задача 5 (level 2): Дан код, нужно сделать этот код запускаемым.

class Task_7 {  //class LoginService

    public static void main(String[] args) {

        System.out.println("You can login!");

    }
}
